{
  "_commit_hash": null,
  "architectures": ["YuanVLChatModel"],
  "auto_map": {
    "AutoConfig": "configuration_yuanvl.YuanVLChatConfig",
    "AutoModel": "modeling_yuanvl_chat.YuanVLChatModel",
    "AutoModelForCausalLM": "modeling_yuanvl_chat.YuanVLChatModel"
  },
  "clip_download_path": "models--InternViT-300M-448px",
  "imagemlp_recompute": true,
  "downsample_ratio": 0.5,
  "dynamic_image_size": true,
  "force_image_size": 448,
  "max_dynamic_patch": 9,
  "min_dynamic_patch": 1,
  "model_type": "yuanvl",
  "ps_version": "v2",
  "select_layer": -1,
  "template": "yuan-chat",
  "torch_dtype": "bfloat16",
  "use_backbone_lora": 0,
  "use_llm_lora": 0,
  "use_thumbnail": true,
  "img_context_token_id": 77188,
  "vision_config":{
    "architectures": [
      "InternVisionModel"
    ],
    "attention_dropout": 0.0,
    "drop_path_rate": 0.0,
    "dropout": 0.0,
    "hidden_act": "gelu",
    "hidden_size": 1024,
    "image_size": 448,
    "initializer_factor": 1.0,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "layer_norm_eps": 1e-06,
    "model_type": "intern_vit_6b",
    "norm_type": "layer_norm",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "output_attentions": false,
    "output_hidden_states": false,
    "patch_size": 14,
    "qk_normalization": false,
    "qkv_bias": true,
    "return_dict": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.37.2",
    "use_bfloat16": true,
    "use_flash_attn": true
  },
  "llm_config": {
      "_from_model_config": true,
      "architectures": [
        "YuanForCausalLM"
      ],
      "attention_projection_size": 4096,
      "attn_dropout": 0.0,
      "auto_map": {
        "AutoConfig": "configuration_yuanvl.YuanConfig",
        "AutoModelForCausalLM": "yuanvl.YuanForCausalLM"
      },
      "causal_mask": true,
      "attn_mask_type": "causal",
      "dropout": 0,
      "hidden_act": "silu",
      "hidden_size": 2048,
      "initializer_range": 0.02,
      "intermediate_size": 8192,
      "use_lf_gate": true,
      "lf_conv2d_group": 1,
      "lf_conv2d_num_pad": 0,
      "use_lfa_bias": true,
      "mask_token_id": 77185,
      "max_position_embeddings": 16384,
      "model_max_length": 16384,
      "model_type": "yuan",
      "ffn_hidden_size": 8192,
      "moe_config": {
        "moe_num_experts": 32,
        "moe_top_k": 2,
        "norm_topk_prob": true,
        "num_attention_router_heads": 1,
        "gated_linear_unit": true,
        "ffn_hidden_size": 8192,
	"router_type": "attn_router"
      },
      "num_attention_heads": 16,
      "num_hidden_layers": 4,
      "output_router_logits": true,
      "pad_token_id": 77188,
      "reset_attention_mask": false,
      "reset_position_ids": false,
      "rms_norm_eps": 1e-06,
      "rotary_base": 10000,
      "rotary_percent": 0.5,
      "tie_word_embeddings": false,
      "rep_token": "<rep>",
      "rep_token_id": 134962,
      "pad_token_id": 77188,
      "eod_token": "<eod>",
      "eod_token_id": 77185,
      "bos_token": "<BOS>",
      "bos_token_id": 134960,
      "sep_token": "<sep>",
      "sep_token_id": 77187,
      "tokenizer_class": "YuanVLTokenizer",
      "torch_dtype": "bfloat16",
      "transformers_version": "4.42.2",
      "use_cache": true,
      "use_flash_attention": true,
      "use_loss_mask": false,
      "use_moe": true,
      "vocab_size": 136064,
      "use_bias": false,
      "use_rope_scaling": false
  },
  "eos_token_id": 77185
}
